# Desribes and testing of functions for data processing

In [1]:
import pandas as pd
import numpy as np

from data_processing import *

In [2]:
test_df = pd.DataFrame({
    "num_var" : np.random.normal(3, 5, 200),
    "cut_var" : np.random.choice(['a', 'b'])
})

# insert_next

Quick insertion following the column selected by name for pandas.DataFrame.

In [3]:
insert_next(test_df, "num_var", test_df["num_var"] / 20)

test_df

      num_var  num_var_transf cut_var
0    2.140943        0.107047       a
1    6.000312        0.300016       a
2   -7.210418       -0.360521       a
3    8.100278        0.405014       a
4    2.222211        0.111111       a
..        ...             ...     ...
195  3.473912        0.173696       a
196 -5.115523       -0.255776       a
197  3.144314        0.157216       a
198  6.767015        0.338351       a
199  2.319092        0.115955       a

[200 rows x 3 columns]

In [4]:
insert_next(test_df, "num_var", test_df["num_var"]*20)

      num_var  num_var_transf cut_var
0    2.140943       42.818856       a
1    6.000312      120.006239       a
2   -7.210418     -144.208356       a
3    8.100278      162.005556       a
4    2.222211       44.444217       a
..        ...             ...     ...
195  3.473912       69.478243       a
196 -5.115523     -102.310466       a
197  3.144314       62.886274       a
198  6.767015      135.340303       a
199  2.319092       46.381849       a

[200 rows x 3 columns]

# get_num_cond

Get condition for selection from pandas.DataFrame numeric data types

In [5]:
get_num_cond(test_df)

num_var            True
num_var_transf     True
cut_var           False
dtype: bool

# pd_OHE

Conduct one hot encoding for pandas data frame with the result as pandas.DataFrame and columns in reading format.

In [8]:
test_df = pd.DataFrame({
        'my_col' : ['a', 'b', 'b', 'a', np.NaN],
        'my_col2': ['d', 'v', 't', 'g', 'q']
})

pd_OHE(test_df, sk_OHE_kwarg = {'drop':['a', 'v']})

   my_col_b  my_col_nan  my_col2_d  my_col2_g  my_col2_q  my_col2_t
0       0.0         0.0        1.0        0.0        0.0        0.0
1       1.0         0.0        0.0        0.0        0.0        0.0
2       1.0         0.0        0.0        0.0        0.0        1.0
3       0.0         0.0        0.0        1.0        0.0        0.0
4       0.0         1.0        0.0        0.0        1.0        0.0